#+PROPERTY: header-args:sql    :exports both
#+PROPERTY: header-args:sql+    :engine mysql
#+PROPERTY: header-args:sql+    :dbhost 192.168.100.103
#+PROPERTY: header-args:sql+    :dbuser ragwebui
#+PROPERTY: header-args:sql+    :dbpassword ragwebui
#+PROPERTY: header-args:sql+    :database ragwebui
#+STARTUP: showall

#+NAME: Databases
#+begin_src sql
show tables;
#+end_src

#+RESULTS: Databases
| Tables_in_ragwebui   |
|----------------------|
| alembic_version      |
| api_keys             |
| chat_knowledge_bases |
| chats                |
| document_chunks      |
| document_uploads     |
| documents            |
| knowledge_bases      |
| messages             |
| processing_tasks     |
| users                |

#+NAME: tables_and_columns
#+begin_src sql
SELECT table_name, column_name, data_type, character_maximum_length as max_len, is_nullable, column_default
FROM information_schema.columns
WHERE table_schema = 'ragwebui'
#+end_src

#+RESULTS: tables_and_columns
| TABLE_NAME           | COLUMN_NAME        | DATA_TYPE | max_len    | IS_NULLABLE | COLUMN_DEFAULT    |
|----------------------+--------------------+-----------+------------+-------------+-------------------|
| alembic_version      | version_num        | varchar   | 32         | NO          | NULL              |
| api_keys             | id                 | int       | NULL       | NO          | NULL              |
| api_keys             | key                | varchar   | 128        | NO          | NULL              |
| api_keys             | name               | varchar   | 255        | NO          | NULL              |
| api_keys             | user_id            | int       | NULL       | NO          | NULL              |
| api_keys             | is_active          | tinyint   | NULL       | NO          | NULL              |
| api_keys             | last_used_at       | datetime  | NULL       | YES         | NULL              |
| api_keys             | created_at         | datetime  | NULL       | NO          | CURRENT_TIMESTAMP |
| api_keys             | updated_at         | datetime  | NULL       | NO          | CURRENT_TIMESTAMP |
| chat_knowledge_bases | chat_id            | int       | NULL       | NO          | NULL              |
| chat_knowledge_bases | knowledge_base_id  | int       | NULL       | NO          | NULL              |
| chats                | id                 | int       | NULL       | NO          | NULL              |
| chats                | title              | varchar   | 255        | NO          | NULL              |
| chats                | user_id            | int       | NULL       | NO          | NULL              |
| chats                | created_at         | datetime  | NULL       | NO          | NULL              |
| chats                | updated_at         | datetime  | NULL       | NO          | NULL              |
| document_chunks      | id                 | varchar   | 64         | NO          | NULL              |
| document_chunks      | kb_id              | int       | NULL       | NO          | NULL              |
| document_chunks      | file_name          | varchar   | 255        | NO          | NULL              |
| document_chunks      | hash               | varchar   | 64         | NO          | NULL              |
| document_chunks      | created_at         | datetime  | NULL       | NO          | CURRENT_TIMESTAMP |
| document_chunks      | updated_at         | datetime  | NULL       | NO          | CURRENT_TIMESTAMP |
| document_chunks      | document_id        | int       | NULL       | NO          | NULL              |
| document_chunks      | chunk_metadata     | json      | NULL       | YES         | NULL              |
| document_uploads     | id                 | int       | NULL       | NO          | NULL              |
| document_uploads     | knowledge_base_id  | int       | NULL       | NO          | NULL              |
| document_uploads     | file_name          | varchar   | 255        | NO          | NULL              |
| document_uploads     | file_hash          | varchar   | 64         | NO          | NULL              |
| document_uploads     | file_size          | bigint    | NULL       | NO          | NULL              |
| document_uploads     | content_type       | varchar   | 100        | NO          | NULL              |
| document_uploads     | temp_path          | varchar   | 255        | NO          | NULL              |
| document_uploads     | created_at         | timestamp | NULL       | NO          | now()             |
| document_uploads     | status             | varchar   | 50         | NO          | pending           |
| document_uploads     | error_message      | text      | 65535      | YES         | NULL              |
| documents            | id                 | int       | NULL       | NO          | NULL              |
| documents            | file_path          | varchar   | 255        | NO          | NULL              |
| documents            | file_name          | varchar   | 255        | NO          | NULL              |
| documents            | file_size          | int       | NULL       | YES         | NULL              |
| documents            | content_type       | varchar   | 100        | YES         | NULL              |
| documents            | file_hash          | varchar   | 64         | YES         | NULL              |
| documents            | knowledge_base_id  | int       | NULL       | NO          | NULL              |
| documents            | created_at         | datetime  | NULL       | NO          | NULL              |
| documents            | updated_at         | datetime  | NULL       | NO          | NULL              |
| knowledge_bases      | id                 | int       | NULL       | NO          | NULL              |
| knowledge_bases      | name               | varchar   | 255        | NO          | NULL              |
| knowledge_bases      | description        | longtext  | 4294967295 | YES         | NULL              |
| knowledge_bases      | user_id            | int       | NULL       | NO          | NULL              |
| knowledge_bases      | created_at         | datetime  | NULL       | NO          | NULL              |
| knowledge_bases      | updated_at         | datetime  | NULL       | NO          | NULL              |
| messages             | id                 | int       | NULL       | NO          | NULL              |
| messages             | chat_id            | int       | NULL       | NO          | NULL              |
| messages             | role               | varchar   | 50         | NO          | NULL              |
| messages             | content            | longtext  | 4294967295 | NO          | NULL              |
| messages             | created_at         | datetime  | NULL       | NO          | NULL              |
| messages             | updated_at         | datetime  | NULL       | NO          | NULL              |
| processing_tasks     | id                 | int       | NULL       | NO          | NULL              |
| processing_tasks     | knowledge_base_id  | int       | NULL       | YES         | NULL              |
| processing_tasks     | document_id        | int       | NULL       | YES         | NULL              |
| processing_tasks     | status             | varchar   | 50         | YES         | NULL              |
| processing_tasks     | error_message      | text      | 65535      | YES         | NULL              |
| processing_tasks     | created_at         | datetime  | NULL       | YES         | NULL              |
| processing_tasks     | updated_at         | datetime  | NULL       | YES         | NULL              |
| processing_tasks     | document_upload_id | int       | NULL       | YES         | NULL              |
| users                | id                 | int       | NULL       | NO          | NULL              |
| users                | email              | varchar   | 255        | NO          | NULL              |
| users                | username           | varchar   | 255        | NO          | NULL              |
| users                | hashed_password    | varchar   | 255        | NO          | NULL              |
| users                | is_active          | tinyint   | NULL       | YES         | NULL              |
| users                | is_superuser       | tinyint   | NULL       | YES         | NULL              |
| users                | created_at         | datetime  | NULL       | NO          | NULL              |
| users                | updated_at         | datetime  | NULL       | NO          | NULL              |

#+begin_src sql
SELECT * FROM users;
#+end_src

#+RESULTS:
| id | email          | username     | hashed_password                                              | is_active | is_superuser | created_at          | updated_at          |
|----+----------------+--------------+--------------------------------------------------------------+-----------+--------------+---------------------+---------------------|
|  1 | deden@akvo.org | dedenakvo    | $2b$12$c909.nyG4zpbvRQi7o.pXOjbne30kTXRWI.tH/wx58o4QXAhJD4Gy |         1 |            0 | 2025-05-07 03:56:41 | 2025-05-07 03:56:41 |
|  2 | dev@akvo.org   | dev@akvo.org | $2b$12$KINWz/x/laB/h4vFtjNtneEVExc0BtWAmKrRZ1YN2MTA0yln5G.oG |         1 |            0 | 2025-05-07 04:13:01 | 2025-05-07 04:13:01 |
